The first line contains a single number to round up — the integer part (a non-empty set of decimal digits that do not start with <span class="tex-span">0</span> — with the exception of a case when the set consists of a single digit — in this case 0 can go first), then follows character «<span class="tex-font-style-tt">.</span>» (a dot), and then follows the fractional part (any non-empty set of decimal digits). The number's length does not exceed <span class="tex-span">1000</span> characters, including the dot. There are no other characters in the input data.
The first line contains integer <span class="tex-span"><i>n</i></span> — the number of cups on the royal table (<span class="tex-span">1 ≤ <i>n</i> ≤ 1000</span>). Next <span class="tex-span"><i>n</i></span> lines contain volumes of juice in each cup — non-negative integers, not exceeding <span class="tex-span">10<sup class="upper-index">4</sup></span>.
The first line contains exactly <span class="tex-span">6</span> characters without spaces from the set {<span class="tex-font-style-tt">R</span>, <span class="tex-font-style-tt">O</span>, <span class="tex-font-style-tt">Y</span>, <span class="tex-font-style-tt">G</span>, <span class="tex-font-style-tt">B</span>, <span class="tex-font-style-tt">V</span>} — they are the colors of gems with which the box should be decorated.
The first line contains a single integer <span class="tex-span"><i>n</i></span> from the problem's statement (<span class="tex-span">1 ≤ <i>n</i> ≤ 10000</span>).
The input consists of three integer numbers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>k</i></span> and <span class="tex-span"><i>n</i><sub class="lower-index">1</sub></span> (<span class="tex-span">10 ≤ <i>n</i> ≤ 12</span>, <span class="tex-span">1 ≤ <i>k</i> ≤ 10</span>, <img align="middle" class="tex-formula" src="http://codeforces.com/predownloaded/c8/6e/c86e1b2378dace3a0d5cca8be0baf574052749c6.png" style="max-width: 100.0%;max-height: 100.0%;" />).
The first line contains <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 1000</span>), where <span class="tex-span"><i>n</i></span> — the number of integers in the group.
You are given two integers <span class="tex-span"><i>a</i></span> and <span class="tex-span"><i>b</i></span>, one per line (<span class="tex-span">1 ≤ <i>a</i>, <i>b</i> &lt; 10<sup class="upper-index">500</sup></span>). These numbers will not have any leading zeros.
The first line contains a single integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">2 ≤ <i>n</i> ≤ 8 × 10<sup class="upper-index">6</sup></span>), the number of Aida's friends. The following two lines contain a <span class="tex-font-style-it">non-empty</span> string each — initial and final strings. The lengths of strings are at most <span class="tex-span">10<sup class="upper-index">7</sup></span> and they only contain English alphabet letters.
The first line of input contains a single integer <span class="tex-span"><i>n</i></span>, the number of lamps (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>).
The first line of the input contains <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 9</span>). The following <span class="tex-span"><i>n</i></span> lines contain integer <span class="tex-span"><i>a</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span"> - 10 ≤ <i>a</i><sub class="lower-index"><i>i</i></sub> ≤ 10</span>).
The first line contains a single integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">0 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>), the number of used names. 
The first line contains number <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10</span>) — the number of boards. Each board is described by 10 lines containing 10 characters each. The symbol &quot;0&quot; stands for an empty square and the symbol &quot;*&quot; stands for a square occupied by a ship. The descriptions of boards are separated with empty lines.
A single integer <span class="tex-span"><i>k</i></span> (<span class="tex-span">0 ≤ <i>k</i> &lt; 360</span>) is given in the first line. Two integer numbers <span class="tex-span"><i>x</i></span> and <span class="tex-span"><i>y</i></span> are given in the second line (<span class="tex-span"> - 1390 ≤ <i>x</i>, <i>y</i> ≤ 1390</span>).
The first line contains a single integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">3</sup></span>), number of intervals.
The first input data line contains a string whose length is equal to <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>). The string consists of lowercase Latin letters. The second line contains the number <span class="tex-span"><i>k</i></span> (<span class="tex-span">0 ≤ <i>k</i> ≤ 10<sup class="upper-index">5</sup></span>).
The first line contains two space-separated integers: <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">9</sup>, 0 ≤ <i>m</i> ≤ 10<sup class="upper-index">5</sup></span>). Then follow <span class="tex-span"><i>m</i></span> lines each containing two integers <span class="tex-span"><i>s</i><sub class="lower-index"><i>i</i></sub>, <i>t</i><sub class="lower-index"><i>i</i></sub></span>. They are the numbers of starting stops and end stops of the buses (<span class="tex-span">0 ≤ <i>s</i><sub class="lower-index"><i>i</i></sub> &lt; <i>t</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i></span>).
The first line contains integers <span class="tex-span"><i>x</i><sub class="lower-index">1</sub></span> и <span class="tex-span"><i>y</i><sub class="lower-index">1</sub></span> — the coordinates of the vector <span class="tex-span"><i>A</i></span> (<span class="tex-span"> - 10<sup class="upper-index">8</sup> ≤ <i>x</i><sub class="lower-index">1</sub>, <i>y</i><sub class="lower-index">1</sub> ≤ 10<sup class="upper-index">8</sup></span>). The second and the third line contain in the similar manner vectors <span class="tex-span"><i>B</i></span> and <span class="tex-span"><i>C</i></span> (their coordinates are integers; their absolute value does not exceed <span class="tex-span">10<sup class="upper-index">8</sup></span>).
The first line contains the only integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">2 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>) — the number of halls in the castle. Next <span class="tex-span"><i>n</i> - 1</span> lines each contain three integers. The <span class="tex-span"><i>i</i></span>-th line contains numbers <span class="tex-span"><i>a</i><sub class="lower-index"><i>i</i></sub></span>, <span class="tex-span"><i>b</i><sub class="lower-index"><i>i</i></sub></span> and <span class="tex-span"><i>t</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>a</i><sub class="lower-index"><i>i</i></sub>, <i>b</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i></span>, <span class="tex-span"><i>a</i><sub class="lower-index"><i>i</i></sub> ≠ <i>b</i><sub class="lower-index"><i>i</i></sub></span>, <span class="tex-span">1 ≤ <i>t</i><sub class="lower-index"><i>i</i></sub> ≤ 1000</span>) — the numbers of halls connected with the <span class="tex-span"><i>i</i></span>-th corridor and the time needed to go along the corridor. Initially Gerald is in the hall number <span class="tex-span">1</span>. It is guaranteed that one can get from any hall to any other one using corridors.
The first line contains three integers <span class="tex-span"><i>n</i>, <i>m</i>, <i>p</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 20000</span>, <span class="tex-span">1 ≤ <i>p</i> ≤ 10<sup class="upper-index">9</sup></span>). The second line contains <span class="tex-span"><i>n</i></span> integers <span class="tex-span"><i>x</i><sub class="lower-index">0</sub></span>, <span class="tex-span"><i>x</i><sub class="lower-index">1</sub></span>, ..., <span class="tex-span"><i>x</i><sub class="lower-index"><i>n</i> - 1</sub></span> (<span class="tex-span">0 ≤ <i>x</i><sub class="lower-index"><i>i</i></sub> ≤ 20000</span>). The third line contains <span class="tex-span"><i>m</i></span> integers <span class="tex-span"><i>y</i><sub class="lower-index">0</sub></span>, <span class="tex-span"><i>y</i><sub class="lower-index">1</sub></span>, ..., <span class="tex-span"><i>y</i><sub class="lower-index"><i>m</i> - 1</sub></span> (<span class="tex-span">0 ≤ <i>y</i><sub class="lower-index"><i>i</i></sub> ≤ 20000</span>). The value of <span class="tex-span"><i>f</i>(<i>a</i>, <i>b</i>)</span> is calculated as a remainder of the division of the sum <span class="tex-span"><i>x</i><sub class="lower-index"><i>a</i></sub> + <i>y</i><sub class="lower-index"><i>b</i></sub></span> by number <span class="tex-span"><i>p</i></span>.
The first input file line contains integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> — the total number of clothing items in the shop and the total number of matching pairs of clothing items (<img align="middle" class="tex-formula" src="http://codeforces.com/predownloaded/4b/cc/4bcc14f64e7643301dcdf18719fc6f21d4a0c660.png" style="max-width: 100.0%;max-height: 100.0%;" />).
The first line contains the only integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">0 ≤ <i>n</i> ≤ 10<sup class="upper-index">100000</sup></span>). It is guaranteed that <span class="tex-span"><i>n</i></span> doesn't contain any leading zeroes.
The first input data line contains a string whose length is equal to <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>). The string consists of lowercase Latin letters. The second line contains the number <span class="tex-span"><i>k</i></span> (<span class="tex-span">0 ≤ <i>k</i> ≤ 10<sup class="upper-index">5</sup></span>).
The first line contains two space-separated integers: <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">9</sup>, 0 ≤ <i>m</i> ≤ 10<sup class="upper-index">5</sup></span>). Then follow <span class="tex-span"><i>m</i></span> lines each containing two integers <span class="tex-span"><i>s</i><sub class="lower-index"><i>i</i></sub>, <i>t</i><sub class="lower-index"><i>i</i></sub></span>. They are the numbers of starting stops and end stops of the buses (<span class="tex-span">0 ≤ <i>s</i><sub class="lower-index"><i>i</i></sub> &lt; <i>t</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i></span>).
The first line contains integers <span class="tex-span"><i>x</i><sub class="lower-index">1</sub></span> и <span class="tex-span"><i>y</i><sub class="lower-index">1</sub></span> — the coordinates of the vector <span class="tex-span"><i>A</i></span> (<span class="tex-span"> - 10<sup class="upper-index">8</sup> ≤ <i>x</i><sub class="lower-index">1</sub>, <i>y</i><sub class="lower-index">1</sub> ≤ 10<sup class="upper-index">8</sup></span>). The second and the third line contain in the similar manner vectors <span class="tex-span"><i>B</i></span> and <span class="tex-span"><i>C</i></span> (their coordinates are integers; their absolute value does not exceed <span class="tex-span">10<sup class="upper-index">8</sup></span>).
The first line contains a positive integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 100</span>). It is the number of questions in the test. The second line contains space-separated <span class="tex-span"><i>n</i></span> positive integers <span class="tex-span"><i>a</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>a</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">9</sup></span>), the number of answer variants to question <span class="tex-span"><i>i</i></span>.
The first line contains two integers — the number of vertices <span class="tex-span"><i>n</i></span> and the number of edges <span class="tex-span"><i>m</i></span> of the graph (<span class="tex-span">1 ≤ <i>n</i> ≤ 100</span>, <span class="tex-span">0 ≤ <i>m</i> ≤ </span><img align="middle" class="tex-formula" src="http://codeforces.com/predownloaded/55/a4/55a47ce60285bda2faf59e39afb2b6c8cbe1647a.png" style="max-width: 100.0%;max-height: 100.0%;" />).
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>k</i></span> and <span class="tex-span"><i>p</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">18</sup>, 0 ≤ <i>k</i> ≤ <i>n</i>, 1 ≤ <i>p</i> ≤ 1000</span>) — the number of slots in the cylinder, the number of bullets and the number of queries. Then follow <span class="tex-span"><i>p</i></span> lines; they are the queries. Each line contains one integer <span class="tex-span"><i>x</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>x</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i></span>) the number of slot to describe.
The first line contains the only positive integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 3·10<sup class="upper-index">5</sup></span>) — the number of cows in the cowavan.
The first line contains the only number <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 300</span>) — the number of sets available in the market.
The only line contains <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 25</span>) — the required sum of points.
The first line contains a positive integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 100</span>). It is the number of questions in the test. The second line contains space-separated <span class="tex-span"><i>n</i></span> positive integers <span class="tex-span"><i>a</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>a</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">9</sup></span>), the number of answer variants to question <span class="tex-span"><i>i</i></span>.
The first line contains two integers — the number of vertices <span class="tex-span"><i>n</i></span> and the number of edges <span class="tex-span"><i>m</i></span> of the graph (<span class="tex-span">1 ≤ <i>n</i> ≤ 100</span>, <span class="tex-span">0 ≤ <i>m</i> ≤ </span><img align="middle" class="tex-formula" src="http://codeforces.com/predownloaded/55/a4/55a47ce60285bda2faf59e39afb2b6c8cbe1647a.png" style="max-width: 100.0%;max-height: 100.0%;" />).
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>k</i></span> and <span class="tex-span"><i>p</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">18</sup>, 0 ≤ <i>k</i> ≤ <i>n</i>, 1 ≤ <i>p</i> ≤ 1000</span>) — the number of slots in the cylinder, the number of bullets and the number of queries. Then follow <span class="tex-span"><i>p</i></span> lines; they are the queries. Each line contains one integer <span class="tex-span"><i>x</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>x</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i></span>) the number of slot to describe.
The first line contains the only positive integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 3·10<sup class="upper-index">5</sup></span>) — the number of cows in the cowavan.
The first line contains three numbers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>m</i></span> and <span class="tex-span"><i>k</i></span> — the number of skills the current character has, the number of skills specific for the class into which the character is going to transmigrate and the reducing coefficient respectively; <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> are integers, and <span class="tex-span"><i>k</i></span> is a real number with exactly two digits after decimal point (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 20</span>, <span class="tex-span">0.01 ≤ <i>k</i> ≤ 0.99</span>).
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>k</i></span> and <span class="tex-span"><i>A</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>k</i> ≤ 8</span>, <span class="tex-span">1 ≤ <i>A</i> ≤ 9999</span>).
The first line contains number <span class="tex-span"><i>n</i></span> (<span class="tex-span">3 ≤ <i>n</i> ≤ 100</span>) — representing how many items Laharl has.
The first line contains two integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 300</span>) — the height and the width of the map (in cells).
The first line contains three integers: Laharl's position, his movement range and throwing range. The second and the third lines describe Etna's and Flonne's parameters correspondingly in the similar form. It is guaranteed that the three characters occupy distinct positions. All numbers in the input are between <span class="tex-span">1</span> and <span class="tex-span">10</span>, inclusive.
The first line contains the tramp suit. It is &quot;<span class="tex-font-style-tt">S</span>&quot;, &quot;<span class="tex-font-style-tt">H</span>&quot;, &quot;<span class="tex-font-style-tt">D</span>&quot; or &quot;<span class="tex-font-style-tt">C</span>&quot;.
The first line contains number <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 100</span>).
The first line contains <span class="tex-span">4</span> integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>m</i></span>, <span class="tex-span"><i>c</i><sub class="lower-index">0</sub></span> and <span class="tex-span"><i>d</i><sub class="lower-index">0</sub></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 1000</span>, <span class="tex-span">1 ≤ <i>m</i> ≤ 10</span>, <span class="tex-span">1 ≤ <i>c</i><sub class="lower-index">0</sub>, <i>d</i><sub class="lower-index">0</sub> ≤ 100</span>). Each of the following <span class="tex-span"><i>m</i></span> lines contains <span class="tex-span">4</span> integers. The <span class="tex-span"><i>i</i></span>-th line contains numbers <span class="tex-span"><i>a</i><sub class="lower-index"><i>i</i></sub></span>, <span class="tex-span"><i>b</i><sub class="lower-index"><i>i</i></sub></span>, <span class="tex-span"><i>c</i><sub class="lower-index"><i>i</i></sub></span> and <span class="tex-span"><i>d</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>a</i><sub class="lower-index"><i>i</i></sub>, <i>b</i><sub class="lower-index"><i>i</i></sub>, <i>c</i><sub class="lower-index"><i>i</i></sub>, <i>d</i><sub class="lower-index"><i>i</i></sub> ≤ 100</span>).
The first line contains two integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">3 ≤ <i>n</i>, <i>m</i> ≤ 1000</span>).
The first line of the input file contains integer <span class="tex-span"><i>n</i></span> — the number of planets (<span class="tex-span">1 ≤ <i>N</i> ≤ 100</span>). Each of the following <span class="tex-span"><i>n</i></span> lines contains information about the planets. The <span class="tex-span"><i>i</i></span>-th line contains three integers <span class="tex-span"><i>x</i><sub class="lower-index"><i>i</i></sub>, <i>y</i><sub class="lower-index"><i>i</i></sub>, <i>z</i><sub class="lower-index"><i>i</i></sub></span> — the coordinates of the <span class="tex-span"><i>i</i></span>-th planet (<span class="tex-span"> - 10<sup class="upper-index">4</sup> ≤ <i>x</i><sub class="lower-index"><i>i</i></sub>, <i>y</i><sub class="lower-index"><i>i</i></sub>, <i>z</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">4</sup></span>, <span class="tex-span">1 ≤ <i>i</i> ≤ <i>n</i></span>). No two planets coincide.
The first line contains two space-separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>p</i></span> <span class="tex-span">(1 ≤ <i>n</i> ≤ 1000, 0 ≤ <i>p</i> ≤ <i>n</i>)</span> — the number of houses and the number of pipes correspondingly. 
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>m</i></span> and <span class="tex-span"><i>h</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 100, 1 ≤ <i>m</i> ≤ 1000, 1 ≤ <i>h</i> ≤ <i>m</i></span>) — the number of players on the team, the number of departments in GUC and Herr Wafa's department, correspondingly. 
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>y</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 16, 2001 ≤ <i>y</i> ≤ 10<sup class="upper-index">18</sup>, 0 ≤ <i>m</i> ≤ 100</span>) — the number of professors, the year for which the arrangement should be computed, and the number of pairs of seats for which the seniority relation should be kept, respectively.
The first line contains two integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>c</i></span> (<span class="tex-span">0 ≤ <i>n</i> ≤ 10<sup class="upper-index">18</sup>, 0 ≤ <i>c</i> ≤ 1000</span>) — the number of crimes Zeyad would like to commit and the number of conditions he is aware of.
The first line of input contains integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 500</span>) — the number of photos on the wall. Then follow <span class="tex-span"><i>n</i></span> lines describing the photos, each containing <span class="tex-span">8</span> single-space-separated integers (coordinates of <span class="tex-span">4</span> vertices): <span class="tex-span"><i>x</i><sub class="lower-index">1</sub></span>, <span class="tex-span"><i>y</i><sub class="lower-index">1</sub></span>, <span class="tex-span"><i>x</i><sub class="lower-index">2</sub></span>, <span class="tex-span"><i>y</i><sub class="lower-index">2</sub></span>, <span class="tex-span"><i>x</i><sub class="lower-index">3</sub></span>, <span class="tex-span"><i>y</i><sub class="lower-index">3</sub></span>, <span class="tex-span"><i>x</i><sub class="lower-index">4</sub></span>, <span class="tex-span"><i>y</i><sub class="lower-index">4</sub></span>. Each photo is a rectangle with a nonzero area. The coordinates are integers, not exceeding <span class="tex-span">10<sup class="upper-index">4</sup></span> by absolute value. The coordinates of the rectangle are given in either clockwise or counterclockwise order.
The first and only line of the input starts with a string with the format &quot;<span class="tex-font-style-tt">HH:MM</span>&quot; where &quot;<span class="tex-font-style-tt">HH</span>&quot; is from &quot;<span class="tex-font-style-tt">00</span>&quot; to &quot;<span class="tex-font-style-tt">23</span>&quot; and &quot;<span class="tex-font-style-tt">MM</span>&quot; is from &quot;<span class="tex-font-style-tt">00</span>&quot; to &quot;<span class="tex-font-style-tt">59</span>&quot;. Both &quot;<span class="tex-font-style-tt">HH</span>&quot; and &quot;<span class="tex-font-style-tt">MM</span>&quot; have exactly two digits.
The first line contains integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">2 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>) — the number of Gava's unsigned integer datatypes' sizes. The second line contains a single-space-separated list of <span class="tex-span"><i>n</i></span> integers (<span class="tex-span">1 ≤ <i>a</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">9</sup></span>) — sizes of datatypes in bits. Some datatypes may have equal sizes.
The first line contains two space-separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>p</i></span> <span class="tex-span">(1 ≤ <i>n</i> ≤ 1000, 0 ≤ <i>p</i> ≤ <i>n</i>)</span> — the number of houses and the number of pipes correspondingly. 
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>m</i></span> and <span class="tex-span"><i>h</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 100, 1 ≤ <i>m</i> ≤ 1000, 1 ≤ <i>h</i> ≤ <i>m</i></span>) — the number of players on the team, the number of departments in GUC and Herr Wafa's department, correspondingly. 
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>y</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 16, 2001 ≤ <i>y</i> ≤ 10<sup class="upper-index">18</sup>, 0 ≤ <i>m</i> ≤ 100</span>) — the number of professors, the year for which the arrangement should be computed, and the number of pairs of seats for which the seniority relation should be kept, respectively.
The only line of the input file contains two natural numbers <span class="tex-font-style-tt">Y</span> and <span class="tex-font-style-tt">W</span> — the results of Yakko's and Wakko's die rolls.
The first line contains three integer numbers: <span class="tex-span">2 ≤ <i>n</i> ≤ 100</span>, <span class="tex-span">1 ≤ <i>v</i><sub class="lower-index"><i>b</i></sub>, <i>v</i><sub class="lower-index"><i>s</i></sub> ≤ 1000</span>. The second line contains <span class="tex-span"><i>n</i></span> non-negative integers in ascending order: coordinates <span class="tex-span"><i>x</i><sub class="lower-index"><i>i</i></sub></span> of the bus stop with index <span class="tex-span"><i>i</i></span>. It is guaranteed that <span class="tex-span"><i>x</i><sub class="lower-index">1</sub></span> equals to zero, and <span class="tex-span"><i>x</i><sub class="lower-index"><i>n</i></sub> ≤ 10<sup class="upper-index">5</sup></span>. The third line contains the coordinates of the University, integers <span class="tex-span"><i>x</i><sub class="lower-index"><i>u</i></sub></span> and <span class="tex-span"><i>y</i><sub class="lower-index"><i>u</i></sub></span>, not exceeding <span class="tex-span">10<sup class="upper-index">5</sup></span> in absolute value. 
Input data contains the only number <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">9</sup></span>).
The input data contains two space-separated positive integer numbers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>h</i></span> (<span class="tex-span"><i>n</i> ≤ 35</span>, <span class="tex-span"><i>h</i> ≤ <i>n</i></span>).
The first line of the input data contains a pair of integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 50</span>, <span class="tex-span">0 ≤ <i>m</i> ≤ 2500</span>) — the amount of vertices and edges respectively. The following lines contain pairs of numbers <span class="tex-span"><i>x</i><sub class="lower-index"><i>i</i></sub></span> and <span class="tex-span"><i>y</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>x</i><sub class="lower-index"><i>i</i></sub></span>, <span class="tex-span"><i>y</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i></span>) — the vertices that are already connected by edges. The initial graph may contain multiple edges and loops.
The single line contains an integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">6</sup></span>) — the sum of digits of the required lucky number.
The single line contains five integers <span class="tex-span"><i>p</i><sub class="lower-index"><i>l</i></sub></span>, <span class="tex-span"><i>p</i><sub class="lower-index"><i>r</i></sub></span>, <span class="tex-span"><i>v</i><sub class="lower-index"><i>l</i></sub></span>, <span class="tex-span"><i>v</i><sub class="lower-index"><i>r</i></sub></span> and <span class="tex-span"><i>k</i></span> (<span class="tex-span">1 ≤ <i>p</i><sub class="lower-index"><i>l</i></sub> ≤ <i>p</i><sub class="lower-index"><i>r</i></sub> ≤ 10<sup class="upper-index">9</sup>, 1 ≤ <i>v</i><sub class="lower-index"><i>l</i></sub> ≤ <i>v</i><sub class="lower-index"><i>r</i></sub> ≤ 10<sup class="upper-index">9</sup>, 1 ≤ <i>k</i> ≤ 1000</span>).
The first line contains the single integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>) — the number of tree vertexes. Next <span class="tex-span"><i>n</i> - 1</span> lines contain three integers each: <span class="tex-span"><i>u</i><sub class="lower-index"><i>i</i></sub></span> <span class="tex-span"><i>v</i><sub class="lower-index"><i>i</i></sub></span> <span class="tex-span"><i>w</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>u</i><sub class="lower-index"><i>i</i></sub>, <i>v</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i>, 1 ≤ <i>w</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">9</sup></span>) — the pair of vertexes connected by the edge and the edge's weight.
The first line contains an integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>) — the number of elements in the array. The second line contains <span class="tex-span"><i>n</i></span> positive integers, not exceeding <span class="tex-span">10<sup class="upper-index">9</sup></span> — the array that needs to be sorted in the non-decreasing order.
The single line contains two integers <span class="tex-span"><i>a</i></span> and <span class="tex-span"><i>l</i></span> (<span class="tex-span">1 ≤ <i>a</i>, <i>l</i> ≤ 10<sup class="upper-index">9</sup></span>) — the interval's first number and the interval's length correspondingly.
The only line contains an integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">18</sup></span>).
The single line contains a positive integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>) — the length of the sought string.
The single line contains an integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">6</sup></span>) — the sum of digits of the required lucky number.
The single line contains five integers <span class="tex-span"><i>p</i><sub class="lower-index"><i>l</i></sub></span>, <span class="tex-span"><i>p</i><sub class="lower-index"><i>r</i></sub></span>, <span class="tex-span"><i>v</i><sub class="lower-index"><i>l</i></sub></span>, <span class="tex-span"><i>v</i><sub class="lower-index"><i>r</i></sub></span> and <span class="tex-span"><i>k</i></span> (<span class="tex-span">1 ≤ <i>p</i><sub class="lower-index"><i>l</i></sub> ≤ <i>p</i><sub class="lower-index"><i>r</i></sub> ≤ 10<sup class="upper-index">9</sup>, 1 ≤ <i>v</i><sub class="lower-index"><i>l</i></sub> ≤ <i>v</i><sub class="lower-index"><i>r</i></sub> ≤ 10<sup class="upper-index">9</sup>, 1 ≤ <i>k</i> ≤ 1000</span>).
The first line contains the single integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>) — the number of tree vertexes. Next <span class="tex-span"><i>n</i> - 1</span> lines contain three integers each: <span class="tex-span"><i>u</i><sub class="lower-index"><i>i</i></sub></span> <span class="tex-span"><i>v</i><sub class="lower-index"><i>i</i></sub></span> <span class="tex-span"><i>w</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>u</i><sub class="lower-index"><i>i</i></sub>, <i>v</i><sub class="lower-index"><i>i</i></sub> ≤ <i>n</i>, 1 ≤ <i>w</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">9</sup></span>) — the pair of vertexes connected by the edge and the edge's weight.
The first line contains three space-separated integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>x</i></span> and <span class="tex-span"><i>y</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup>, 1 ≤ <i>x</i> ≤ 10<sup class="upper-index">12</sup>, 1 ≤ <i>y</i> ≤ 10<sup class="upper-index">6</sup></span>).
The first line contains an integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>). Each of the following <span class="tex-span"><i>n</i></span> lines contain two space-separated integers <span class="tex-span"><i>x</i><sub class="lower-index"><i>i</i></sub></span> and <span class="tex-span"><i>y</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>x</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">5</sup></span>, <span class="tex-span">0 ≤ <i>y</i><sub class="lower-index"><i>i</i></sub> ≤ <i>i</i> - 1</span>, where <span class="tex-span"><i>i</i></span> is the query's ordinal number; the numeration starts with <span class="tex-span">1</span>). 
The first line contains two space-separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 40, <i>n</i>·<i>m</i> ≤ 40</span>) — the board sizes.
The first line contains space-separated integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>m</i></span> and <span class="tex-span"><i>k</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 1000, 1 ≤ <i>k</i> ≤ 10<sup class="upper-index">6</sup></span>) — the board's vertical and horizontal sizes and the number of colors respectively.
The first line contains space-separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">4 ≤ <i>n</i>, <i>m</i> ≤ 1000</span>) — the number of rows and the number of columns in the rectangle, correspondingly. The second line contains space-separated integers <span class="tex-span"><i>x</i><sub class="lower-index">1</sub></span> and <span class="tex-span"><i>y</i><sub class="lower-index">1</sub></span> — the coordinates of the first marked cell. The third line contains space-separated integers <span class="tex-span"><i>x</i><sub class="lower-index">2</sub></span> <span class="tex-span"><i>y</i><sub class="lower-index">2</sub></span> — the coordinates of the second marked cell (<span class="tex-span">1 &lt; <i>x</i><sub class="lower-index">1</sub>, <i>x</i><sub class="lower-index">2</sub> &lt; <i>n</i>, 1 &lt; <i>y</i><sub class="lower-index">1</sub>, <i>y</i><sub class="lower-index">2</sub> &lt; <i>m</i>, <i>x</i><sub class="lower-index">1</sub> ≠ <i>x</i><sub class="lower-index">2</sub>, <i>y</i><sub class="lower-index">1</sub> ≠ <i>y</i><sub class="lower-index">2</sub></span>).
Each of the first two lines contains a bought string. The strings' lengths range from <span class="tex-span">1</span> to <span class="tex-span">100</span> inclusive. It is guaranteed that the strings are of the same length and also consist of uppercase and lowercase Latin letters.
The first line contains three space-separated integers <span class="tex-span">2<i>n</i></span>, <span class="tex-span"><i>x</i></span> and <span class="tex-span"><i>y</i></span> (<span class="tex-span">2 ≤ 2<i>n</i> ≤ 100, 1 ≤ <i>x</i>, <i>y</i> ≤ 2<i>n</i></span>), representing the length of a square's side and the coordinates of the marked cell. It is guaranteed that <span class="tex-span">2<i>n</i></span> is even.
The first line contains three space-separated integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>x</i></span> and <span class="tex-span"><i>y</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup>, 1 ≤ <i>x</i> ≤ 10<sup class="upper-index">12</sup>, 1 ≤ <i>y</i> ≤ 10<sup class="upper-index">6</sup></span>).
The first line contains an integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>). Each of the following <span class="tex-span"><i>n</i></span> lines contain two space-separated integers <span class="tex-span"><i>x</i><sub class="lower-index"><i>i</i></sub></span> and <span class="tex-span"><i>y</i><sub class="lower-index"><i>i</i></sub></span> (<span class="tex-span">1 ≤ <i>x</i><sub class="lower-index"><i>i</i></sub> ≤ 10<sup class="upper-index">5</sup></span>, <span class="tex-span">0 ≤ <i>y</i><sub class="lower-index"><i>i</i></sub> ≤ <i>i</i> - 1</span>, where <span class="tex-span"><i>i</i></span> is the query's ordinal number; the numeration starts with <span class="tex-span">1</span>). 
The first line contains two space-separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 40, <i>n</i>·<i>m</i> ≤ 40</span>) — the board sizes.
The first line contains one or more words consisting of lowercase Latin letters. The overall number of characters (including letters and spaces) does not exceed <span class="tex-span">10<sup class="upper-index">5</sup></span>.
The input file consists of three lines. The first line contains string <span class="tex-span"><i>t</i></span>. The second and the third lines contain the <span class="tex-span"><i>s</i><sub class="lower-index"><i>begin</i></sub></span> and <span class="tex-span"><i>s</i><sub class="lower-index"><i>end</i></sub></span> identificators, correspondingly. All three lines are non-empty strings consisting of lowercase Latin letters. The length of each string doesn't exceed 2000 characters.
The first line of the input contains integer numbers <span class="tex-span"><i>l</i>, <i>r</i></span> (<span class="tex-span">1 ≤ <i>l</i>, <i>r</i> ≤ 3·10<sup class="upper-index">8</sup></span>).
The first line contains four integers: <span class="tex-span"><i>n</i></span> <span class="tex-span">(1 ≤ <i>n</i> ≤ 22)</span>, representing the numbers of rooms; <span class="tex-span"><i>m</i></span> <img align="middle" class="tex-formula" src="http://codeforces.com/predownloaded/91/51/915178a47342cdb4f3a599469087a92fddb1255b.png" style="max-width: 100.0%;max-height: 100.0%;" />, representing the number of corridors; <span class="tex-span"><i>a</i>, <i>b</i></span> <span class="tex-span">(1 ≤ <i>a</i>, <i>b</i> ≤ <i>n</i>)</span>, representing the numbers of Petya's and Vasya's starting rooms correspondingly.
The first line of the input file contains three space-separated integers <span class="tex-span"><i>h</i></span>, <span class="tex-span"><i>m</i></span> and <span class="tex-span"><i>k</i></span> (<span class="tex-span">2 ≤ <i>h</i>, <i>m</i> ≤ 10<sup class="upper-index">9</sup></span>, <span class="tex-span">1 ≤ <i>k</i> ≤ 20</span>). The second line contains space-separated integers <span class="tex-span"><i>h</i><sub class="lower-index">1</sub></span>, <span class="tex-span"><i>m</i><sub class="lower-index">1</sub></span> (<span class="tex-span">0 ≤ <i>h</i><sub class="lower-index">1</sub> &lt; <i>h</i></span>, <span class="tex-span">0 ≤ <i>m</i><sub class="lower-index">1</sub> &lt; <i>m</i></span>). The third line contains space-separated integers <span class="tex-span"><i>h</i><sub class="lower-index">2</sub></span>, <span class="tex-span"><i>m</i><sub class="lower-index">2</sub></span> (<span class="tex-span">0 ≤ <i>h</i><sub class="lower-index">2</sub> &lt; <i>h</i></span>, <span class="tex-span">0 ≤ <i>m</i><sub class="lower-index">2</sub> &lt; <i>m</i></span>).
The first input line contains integer number <span class="tex-span"><i>k</i></span>, the second line contains integer number <span class="tex-span"><i>l</i></span> (<span class="tex-span">2 ≤ <i>k</i>, <i>l</i> ≤ 2<sup class="upper-index">31</sup> - 1</span>).
The first line contains two integer numbers <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 16</span>) — the number of volunteers, and <span class="tex-span"><i>m</i></span> (<img align="middle" class="tex-formula" src="http://codeforces.com/predownloaded/9b/07/9b07d4381eb0641662d0fae9fb5943caf8ce77b0.png" style="max-width: 100.0%;max-height: 100.0%;" />) — the number of pairs that do not get on. Next <span class="tex-span"><i>n</i></span> lines contain the volunteers' names (each name is a non-empty string consisting of no more than 10 uppercase and/or lowercase Latin letters). Next <span class="tex-span"><i>m</i></span> lines contain two names — the names of the volunteers who do not get on. The names in pair are separated with a single space. Each pair of volunteers who do not get on occurs exactly once. The strings are case-sensitive. All <span class="tex-span"><i>n</i></span> names are distinct.
The first line contains one or more words consisting of lowercase Latin letters. The overall number of characters (including letters and spaces) does not exceed <span class="tex-span">10<sup class="upper-index">5</sup></span>.
The input file consists of three lines. The first line contains string <span class="tex-span"><i>t</i></span>. The second and the third lines contain the <span class="tex-span"><i>s</i><sub class="lower-index"><i>begin</i></sub></span> and <span class="tex-span"><i>s</i><sub class="lower-index"><i>end</i></sub></span> identificators, correspondingly. All three lines are non-empty strings consisting of lowercase Latin letters. The length of each string doesn't exceed 2000 characters.
The first line of the input contains integer numbers <span class="tex-span"><i>l</i>, <i>r</i></span> (<span class="tex-span">1 ≤ <i>l</i>, <i>r</i> ≤ 3·10<sup class="upper-index">8</sup></span>).
The first line contains integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 2000</span>) — the number of employees.
The first line contains two integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 150</span>) — the number of rows and columns respectively. Then follow <span class="tex-span"><i>n</i></span> lines containing <span class="tex-span"><i>m</i></span> characters each — the content of the grid. &quot;<span class="tex-font-style-tt">G</span>&quot; means that this cell contains grass. &quot;<span class="tex-font-style-tt">W</span>&quot; means that this cell contains weeds. 
The first line will contain two single-space separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i>, <i>n</i>·<i>m</i> ≤ 5·10<sup class="upper-index">5</sup></span>) — the number of rows and columns respectively. Then <span class="tex-span"><i>n</i></span> lines follow, each contains exactly <span class="tex-span"><i>m</i></span> characters — the description of the grid. Each character describes a cell and is either one of these: 
The first line is a <span class="tex-font-style-it">non-empty</span> string consisting of digits ('0'-'9') and characters '-', '+', '*', and/or '/'. Its length will not exceed <span class="tex-span">2000</span>. The line doesn't contain any spaces.
The first line contains two single-space separated integers, <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 2·10<sup class="upper-index">5</sup></span>), denoting the number of roads and the number of races, respectively.
The first line contains a single number <span class="tex-span"><i>n</i></span> (<span class="tex-span">2 ≤ <i>n</i> ≤ 1000</span>) — the number of the tram's stops. 
The first line contains integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 10</span>) which denotes the number of rows and columns in our two-dimensional grid, respectively. Then follow <span class="tex-span"><i>n</i></span> lines containing <span class="tex-span"><i>m</i></span> characters each — that is the grid description. &quot;<span class="tex-font-style-tt">.</span>&quot; means that this cell is empty. &quot;<span class="tex-font-style-tt">P</span>&quot; means that this cell contains a little pig. &quot;<span class="tex-font-style-tt">W</span>&quot; means that this cell contains a wolf. 
The first line contains integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 2000</span>) — the number of employees.
The first line contains two integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i> ≤ 150</span>) — the number of rows and columns respectively. Then follow <span class="tex-span"><i>n</i></span> lines containing <span class="tex-span"><i>m</i></span> characters each — the content of the grid. &quot;<span class="tex-font-style-tt">G</span>&quot; means that this cell contains grass. &quot;<span class="tex-font-style-tt">W</span>&quot; means that this cell contains weeds. 
The first line will contain two single-space separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i>, <i>m</i>, <i>n</i>·<i>m</i> ≤ 5·10<sup class="upper-index">5</sup></span>) — the number of rows and columns respectively. Then <span class="tex-span"><i>n</i></span> lines follow, each contains exactly <span class="tex-span"><i>m</i></span> characters — the description of the grid. Each character describes a cell and is either one of these: 
The first line contains two space-separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup>, 2 ≤ <i>m</i> ≤ 10<sup class="upper-index">8</sup></span>). 
The first line contains three integers <span class="tex-span"><i>a</i></span>, <span class="tex-span"><i>b</i></span>, <span class="tex-span"><i>mod</i></span> (<span class="tex-span">0 ≤ <i>a</i>, <i>b</i> ≤ 10<sup class="upper-index">9</sup></span>, <span class="tex-span">1 ≤ <i>mod</i> ≤ 10<sup class="upper-index">7</sup></span>).
The first line contains an integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 5000</span>). Next <span class="tex-span"><i>n</i></span> lines contain the adjacency matrix <span class="tex-span"><i>A</i></span> of the graph (without spaces). <span class="tex-span"><i>A</i><sub class="lower-index"><i>i</i>, <i>j</i></sub> = 1</span> if the graph has an edge going from vertex <span class="tex-span"><i>i</i></span> to vertex <span class="tex-span"><i>j</i></span>, otherwise <span class="tex-span"><i>A</i><sub class="lower-index"><i>i</i>, <i>j</i></sub> = 0</span>. <span class="tex-span"><i>A</i><sub class="lower-index"><i>i</i>, <i>j</i></sub></span> stands for the <span class="tex-span"><i>j</i></span>-th character in the <span class="tex-span"><i>i</i></span>-th line.
The first line contains three integers <span class="tex-span"><i>n</i></span>, <span class="tex-span"><i>m</i></span>, <span class="tex-span"><i>mod</i></span> (<span class="tex-span">1 ≤ <i>n</i> ≤ 10<sup class="upper-index">18</sup>, 1 ≤ <i>m</i> ≤ 10<sup class="upper-index">5</sup>, 1 ≤ <i>mod</i> ≤ 10<sup class="upper-index">9</sup></span>). Next <span class="tex-span"><i>m</i></span> lines describe the queries. Each query is defined by four integers <span class="tex-span"><i>l</i></span>, <span class="tex-span"><i>r</i></span>, <span class="tex-span"><i>u</i></span>, <span class="tex-span"><i>v</i></span> (<span class="tex-span">1 ≤ <i>l</i> ≤ <i>r</i> ≤ <i>n</i></span>, <span class="tex-span">1 ≤ <i>u</i> ≤ <i>v</i> ≤ 10<sup class="upper-index">18</sup></span>).
The first line contains two integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>m</i></span> (<span class="tex-span">3 ≤ <i>n</i> ≤ 10<sup class="upper-index">5</sup></span>, <span class="tex-span">1 ≤ <i>m</i> ≤ 10<sup class="upper-index">5</sup></span>). Then <span class="tex-span"><i>n</i></span> lines describe the graph edges as <span class="tex-span"><i>a</i></span> <span class="tex-span"><i>b</i></span> (<span class="tex-span">1 ≤ <i>a</i>, <i>b</i> ≤ <i>n</i></span>). Next <span class="tex-span"><i>m</i></span> lines contain the queries as <span class="tex-span"><i>v</i></span> <span class="tex-span"><i>u</i></span> (<span class="tex-span">1 ≤ <i>v</i>, <i>u</i> ≤ <i>n</i></span>). 
The first line represents input string of Petya's program. This string only consists of uppercase and lowercase Latin letters and its length is from <span class="tex-span">1</span> to <span class="tex-span">100</span>, inclusive.
The first line contains the single integer <span class="tex-span"><i>n</i></span> (<span class="tex-span">2 ≤ <i>n</i> ≤ 9</span>).
The first line contains two space-separated integers <span class="tex-span"><i>n</i></span> and <span class="tex-span"><i>k</i></span> (<span class="tex-span">2 ≤ <i>n</i> ≤ 10<sup class="upper-index">4</sup>, 2 ≤ <i>k</i> ≤ <i>n</i></span>) which represent how many digits the number has and how many equal digits a beautiful number should have. The second line consists of <span class="tex-span"><i>n</i></span> digits. It describes the old number of Vasya's car. It is guaranteed that the number contains no spaces and only contains digits.
